jekyll/_posts/2011-08-15-the-dark-side-of-javascript.html
---
layout: post
title:  The Dark-Side of JavaScript
snip:   On making functional JavaScript deliciously sweet.
---


<p>
<a href="http://github.com/killdream/black">Black</a> is an extension to JavaScript's standard objects, providing
missing functionality, a few aliases and making using generic functions
sweeter.
</p>
<p>
It supports both functional style:
</p>



<pre class="src src-javascript">black.unpack_all([<span style="color: #A6E32D;">'utils'</span>, <span style="color: #A6E32D;">'generic'</span>])
each(map(filter(links, selectedp)
        ,text)
    ,display)
</pre>



<p>
And Object Oriented style:
</p>



<pre class="src src-javascript">black.unpack_all([<span style="color: #A6E32D;">'own'</span>])
black.list.to_array(links).filter(selectedp)
                          .map(text)
                          .each(display)
</pre>



<p>
And it can use either the global scope or patch the native object's
prototype directly, if <b>you</b> decide to do so.
</p>
<p>
If you're on Node.js, you can just install it from npm:
</p>



<pre class="src src-shell-script">$ npm install black
</pre>



<p>
Otherwise, clone the github repository and follow the
<a href="http://killdream.github.com/black/docs/deploy/overview/installing.html">installation instructions</a>.
</p>



<pre class="src src-shell-script">$ git clone htp://github.com/killdream/black.git

<span style="color: #75766A;"># </span><span style="color: #75766A;">Or if you use hg-git, like me:
</span>$ hg clone http://github.com/killdream/black.git
</pre>





<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">The issues </h2>
<div class="outline-text-2" id="text-1">


<p>
Black didn't just sprung out of nowhere, it came into existence to fix
several issues I've had while writing JavaScript code. 
</p>


</div>

<div id="outline-container-1_1" class="outline-3">
<h3 id="sec-1_1">Lack of functionality and generic sugar </h3>
<div class="outline-text-3" id="text-1_1">


<p>
The main issue was that I often had to write the same functions over and over
again, because the standard library didn't provide them.
</p>
<p>
That goes from the simple object handling, that is, merging two objects, from
sequence handling, which I do use <b>a lot</b>. On this release, I've tried to
include the features I miss the most, for numbers, functions, objects and
sequences.
</p>
<p>
Yes, <b>sequences</b>, not <b>Arrays</b>. Since JavaScript is weakly-typed to the very
core, mostly functionality is intentionally generic. However, using those
generic functions on non-arrays is usually a huge. pain. in. the. ass:
</p>



<pre class="src src-javascript"><span style="color: #C48DFF;">var</span> <span style="color: #729FCF;">seq</span> = {0: 1, 1: 2, 2: 3, length: 3}
Array.<span style="color: #FA2573;">prototype</span>.map.call(seq, <span style="color: #C48DFF;">function</span>(<span style="color: #729FCF;">x</span>){ <span style="color: #C48DFF;">return</span> x + 1 })
<span style="color: #75766A;">// </span><span style="color: #75766A;">=&gt; [2, 3, 4]
</span></pre>



<p>
That unnecessary verbosity really annoys me. Other thing that does so is the
inconsistency in own and generic methods. You can't just have
<code>Array.slice(sequence)</code>, even though the method is supposed to be generic, you
need to apply an Array's own method to another object type if you need it. For
me, it just makes no sense.
</p>

</div>

</div>

<div id="outline-container-1_2" class="outline-3">
<h3 id="sec-1_2">Verbosity and hatefulCamelCaseIsHateful </h3>
<div class="outline-text-3" id="text-1_2">


<p>
The second major issue I have is the naming convention used in
JavaScript. Sorry guys, but camelCase sucks way too much to be taken
seriously. And on top of that, lots of functionality have unnecessary and
overly verbose names.
</p>
<p>
Note that when I say <i>verbose</i> I don't necessarily mean <b>long</b>. There's a huge
difference here. Verbosity is the unnecessary extension of a name just for the
sake of having a long name. Descriptive and concise names are your friends when
you actually want to read a piece of code.
</p>

</div>

</div>

<div id="outline-container-1_3" class="outline-3">
<h3 id="sec-1_3">Aliasing hell </h3>
<div class="outline-text-3" id="text-1_3">


<p>
One thing I noticed a lot lately, is that all my JavaScript files were
starting with the following:
</p>



<pre class="src src-javascript"><span style="color: #C48DFF;">var</span> <span style="color: #729FCF;">map</span>    = [].map
  , each   = [].each
  , some   = [].some
  , every  = [].every
  , reduce = [].reduce
  , filter = [].filter
  , slice  = [].slice
  , hasp   = {}.hasOwnProperty
  , ( ... )
</pre>



<p>
Things were coming to a point that I had written a template in <a href="http://code.google.com/p/yasnippet">Yasnippet</a> to
include all those lines for me. But well, even so, it was still quite
unwielding and I still raged every time I saw that shitload of aliases at the
start of every file (things only got worse when the file used external
libraries, btw).
</p>
<p>
If only current ECMAScript had <a href="https://developer.mozilla.org/En/New_in_JavaScript_1.7#Destructuring_assignment_(Merge_into_own_page.2fsection)">destructuring assignment</a> support, things
wouldn't be as bad:
</p>



<pre class="src src-javascript"><span style="color: #C48DFF;">var</span> {map, each, reduce, filter} = Array.<span style="color: #FA2573;">prototype</span>
</pre>



<p>
Which is not that much different from Python's:
</p>



<pre class="src src-python"><span style="color: #C48DFF;">from</span> module <span style="color: #C48DFF;">import</span> x, y, z
</pre>



<p>
Except you can import anything you want from any object. Having written some
code for SpiderMonkey-only projects before, I can say that JavaScript 1.7
introduces quite a lot of awesomeness I missed in the language for a long time
(and still miss&hellip;)
</p>

</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">What Black provides </h2>
<div class="outline-text-2" id="text-2">



</div>

<div id="outline-container-2_1" class="outline-3">
<h3 id="sec-2_1">Extensions </h3>
<div class="outline-text-3" id="text-2_1">


<p>
The main point of Black is to include extensions for working with the
standard objects. Most of the extensions are for working with sequences,
and objects. Extensions are logically divided in modules, and can be
used separately.
</p>
<dl>
<dt>type</dt><dd>

<p>
Provides type, interface and functionality testing.
</p>
</dd>
<dt>obj</dt><dd>

<p>
Handles objects as sets of key/values. This includes extracting
lists of keys and values, cherry-picking and transforming them.
</p>
</dd>
<dt>list</dt><dd>

<p>
Handles iteration and manipulation of sequence's structure and
items.
</p>
</dd>
<dt>str</dt><dd>

<p>
Provides generic aliases for built-in utilities and sugar for
JS/CSS interop.
</p>
</dd>
<dt>num</dt><dd>

<p>
Provides a few mathematical functions for boundary handling and
padding.
</p>
</dd>
<dt>fn</dt><dd>

<p>
Provides a few functional utilities. Currently not much useful.
</p>
</dd>
</dl>

</div>

</div>

<div id="outline-container-2_2" class="outline-3">
<h3 id="sec-2_2">Sane API naming </h3>
<div class="outline-text-3" id="text-2_2">


<p>
Black's API uses a naming convention derived from Python and Lisp. Words
are written in all lower-case and separated by underscores. Names are
kept concise and descriptive.
</p>
<p>
From Common Lisp, it uses the <code>p</code>-suffix naming convention for predicate
functions (like <code>nullp</code> for <code>null?</code> or <code>isNull</code>). And <code>n</code>-prefix for
destructive functions when a pure alternative exists.
</p>
<p>
For functions that construct objects, a <code>make_</code> prefix is used.
</p>

</div>

</div>

<div id="outline-container-2_3" class="outline-3">
<h3 id="sec-2_3">Patching </h3>
<div class="outline-text-3" id="text-2_3">


<p>
The actual thing about Black, though, is how it handles the aliasing
hell issue. The <code>core</code> module provides unpacker functions that copies
properties from an Object to another one. Modules decide which
functionality they want to export and where they want it exported by
default.
</p>
<p>
The unpackers separate functionality into <code>utils</code>, which are exported to
the global object; <code>generic</code>, which are exported directly into the
constructor function; and <code>own</code>, which are exported into the
<code>[⁣[Prototype]⁣]</code>.
</p>
<p>
This patching is carried by two functions, the <i>just-do-the-right-thing(tm)</i>
one, <code>unpack_all</code>, which will follow the defaults the modules have provided:
</p>



<pre class="src src-javascript">black.unpack_all([<span style="color: #A6E32D;">'utils'</span>, <span style="color: #A6E32D;">'generic'</span>, <span style="color: #A6E32D;">'own'</span>])
<span style="color: #C48DFF;">var</span> <span style="color: #729FCF;">factor</span> = 2
first(range(1, 10).filter(<span style="color: #C48DFF;">function</span>(<span style="color: #729FCF;">x</span>){
    <span style="color: #C48DFF;">return</span> x &gt; 3 * factor }))
<span style="color: #75766A;">// </span><span style="color: #75766A;">=&gt; 7
</span></pre>



<p>
And the fine-tuned one, if you want control over where you want your
stuff, <code>unpack</code>:
</p>



<pre class="src src-javascript"><span style="color: #C48DFF;">var</span> <span style="color: #729FCF;">numbers</span> = [1, 2, 3, 4, 5]
black.unpack([<span style="color: #A6E32D;">'own'</span>], <span style="color: #FA2573;">null</span>              <span style="color: #75766A;">// </span><span style="color: #75766A;">global target
</span>                    , <span style="color: #FA2573;">null</span>              <span style="color: #75766A;">// </span><span style="color: #75766A;">generic target
</span>                    , Array.<span style="color: #FA2573;">prototype</span>   <span style="color: #75766A;">// </span><span style="color: #75766A;">own
</span>                    , black.list )      <span style="color: #75766A;">// </span><span style="color: #75766A;">source
</span>
<span style="color: #C48DFF;">function</span> <span style="color: #67D9F0;">squared</span>(<span style="color: #729FCF;">x</span>){ <span style="color: #C48DFF;">return</span> x * x      }
<span style="color: #C48DFF;">function</span> <span style="color: #67D9F0;">evenp</span>(<span style="color: #729FCF;">x</span>)  { <span style="color: #C48DFF;">return</span> x % 2 == 0 }
numbers.map(squared).filter(evenp).first()
<span style="color: #75766A;">// </span><span style="color: #75766A;">=&gt; 4
</span></pre>



</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">Wrapping it up </h2>
<div class="outline-text-2" id="text-3">


<p>
This is still an early release of the library, it's usable, but not
thoroughly tested (and all tests have been done only on
Node.js). Though, it has some documentation and examples, and most
functionality I wanted for now, so I'm just making an early release.
</p>
<p>
I'm planning checking for set difference in the unpackers to avoid
silently writing existing functionality, associative sequence handling,
and other stuff, so well, still lots of work to do :3
</p></div>
</div>
